Documents/ПереводСырьяВПродукцию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ПереводСырьяВПродукцию</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Остатки</xr:Item>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СкладСырья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склад</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склад</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СырьеПродукция</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЧтоОтправляем</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Остаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СколькоОтправляем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧтоПолучаем</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>3</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаИзготовления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПереводСырьяВПродукцию/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СырьеПродукцияЧтоОтправляемОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Оп = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияФормы", ЭтаФорма);
	
	КлючЗаписи = Новый Структура;
	КлючЗаписи.Вставить("ОстДата", Объект.Дата);
	КлючЗаписи.Вставить("ОстНоменклатура", ВыбранноеЗначение);
	КлючЗаписи.Вставить("ОстСклад", Объект.СкладСырья);
	ОткрытьФорму("ОбщаяФорма.ФормаПодбора", КлючЗаписи,,,,,Оп);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеЗакрытияФормы(РезультатЗакрытия, ДопПараметры) Экспорт
	
	Если Не РезультатЗакрытия = Неопределено Тогда
		Элементы.СырьеПродукция.ТекущиеДанные.ЧтоОтправляем = РезультатЗакрытия[0].Значение;
		Элементы.СырьеПродукция.ТекущиеДанные.ДатаИзготовления = Объект.Дата;
		Элементы.СырьеПродукция.ТекущиеДанные.Остаток = РезультатЗакрытия[3].Значение;
		Если РезультатЗакрытия[2].Значение = "" Тогда 
			Элементы.СырьеПродукция.ТекущиеДанные.Партия = "001";
		Иначе 
			Элементы.СырьеПродукция.ТекущиеДанные.Партия = РезультатЗакрытия[2].Значение;
		КонецЕсли;
	КонецЕсли
	
КонецПроцедуры

#КонецОбласти
